tap "charmbracelet/tap"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "xwmx/taps"

# Email client that runs in your terminal
brew "aerc"
# Simple, modern, secure file encryption
brew "age"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Non-web browser, designed for a growing list of protocols
brew "bombadillo"
# Process Management Interface for HPC environments
brew "pmix"
# High performance message passing library
brew "open-mpi"
# Console-based Audio Visualizer for ALSA
brew "cava"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Command-line DNS client
brew "dog"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Version Control Visualization Tool
brew "gource"
# Library access to GnuPG
brew "gpgme"
# Manage your GnuPG keys with ease!
brew "gpg-tui"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Cryptographic recipes and primitives for Python
brew "python-cryptography"
# Command-line note taker
brew "jrnl"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Library to render SVG files using Cairo
brew "librsvg"
# Terminal-based visual file manager
brew "midnight-commander"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Terminal-based audio engine, library, player and server
brew "musikcube"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Library for color text mode, widget based user interfaces
brew "newt"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Password manager
brew "pass"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Send emails from your terminal
brew "pop"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Decentralised, minimalist microblogging service for hackers
brew "twtxt"
# Vi 'workalike' with many additional features
brew "vim"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Yet Another Dotfiles Manager
brew "yadm"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A personal key value store 🛼
brew "charmbracelet/tap/skate"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@28"
brew "xwmx/taps/nb"
# Command-line interface for 1Password
cask "1password-cli"
# Desktop GUI client for browsing Geminispace
cask "lagrange"
# Neovim Client
cask "neovide"
# Terminal emulator, SSH and serial client
cask "tabby"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm-nightly"
vscode "aaron-bond.better-comments"
vscode "astro-build.astro-vscode"
vscode "be5invis.toml"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "dotenv.dotenv-vscode"
vscode "dustypomerleau.rust-syntax"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "haskell.haskell"
vscode "haydenbleasel.vercel-vscode"
vscode "jasonnutter.vscode-codeowners"
vscode "jscearcy.rust-doc-viewer"
vscode "justusadam.language-haskell"
vscode "lorenzopirro.rust-flash-snippets"
vscode "mattn.lisp"
vscode "mindaro-dev.file-downloader"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "npxms.hide-gitignored"
vscode "nyxiative.rust-and-friends"
vscode "polymeilex.rust-targets"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "sglza.flexoki"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "skellock.just"
vscode "svelte.svelte-vscode"
vscode "tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "zhangyue.rust-mod-generator"
